In [3]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy.exc import SQLAlchemyError
import getpass

# Establish a connection between Python and the Sakila database.
# Write a Python function called `rentals_month` that retrieves rental data for a given month and year (passed as parameters) 
# from the Sakila database as a Pandas DataFrame.
def rentals_month(engine, month, year):
    try:
        query = f"""
            SELECT rental_id, rental_date, inventory_id, customer_id, staff_id
            FROM rental
            WHERE MONTH(rental_date) = {month}
            AND YEAR(rental_date) = {year};
        """
        df = pd.read_sql(query, engine)
        return df
    except SQLAlchemyError as e:
        print(f"Error occurred: {e}")
        return None

# Securely prompt for password
password = getpass.getpass("Enter your MySQL password: ")

# Create engine with password input
engine = create_engine(f'mysql+pymysql://root:{password}@localhost/sakila')

# Retrieve and display data for May 2005
rentals_df = rentals_month(engine, 5, 2005)
if rentals_df is not None:
    display(rentals_df.head())

   rental_id         rental_date  inventory_id  customer_id  staff_id
0          1 2005-05-24 22:53:30           367          130         1
1          2 2005-05-24 22:54:33          1525          459         1
2          3 2005-05-24 23:03:39          1711          408         1
3          4 2005-05-24 23:04:41          2452          333         2
4          5 2005-05-24 23:05:21          2079          222         1

In [8]:
def rental_count_month(df, month, year):
    # Group by customer_id and count the number of rentals for each customer
    rental_counts = df.groupby('customer_id').size().reset_index(name=f'rentals_{month:02}_{year}')
    
    return rental_counts

rental_counts_may_2005 = rental_count_month(rentals_df, 5, 2005)

# Display the result
print(rental_counts_may_2005.head())

   customer_id  rentals_05_2005
0            1                2
1            2                1
2            3                2
3            5                3
4            6                3

In [16]:
# Create a Python function called `compare_rentals` that takes two DataFrames as input containing the number of rentals made 
# by each customer in different months and years. 
# The function should return a combined DataFrame with a new 'difference' column, which is the difference between 
# the number of rentals in the two months.
def compare_rentals(df1, df2):
    # Merge the two DataFrames on customer_id
    merged_df = pd.merge(df1, df2, on='customer_id')
    
    # Create a new column 'difference' that contains the difference between the number of rentals in the two months
    merged_df['difference'] = merged_df[f'rentals_{df1.columns[1]:02}_{df1.columns[2]}'] - merged_df[f'rentals_{df2.columns[1]:02}_{df2.columns[2]}']
    
    return merged_df

rental_counts_may_2005 = rental_count_month(rentals_df, 5, 2005)
rental_counts_may_2005

     customer_id  rentals_05_2005
0              1                2
1              2                1
2              3                2
3              5                3
4              6                3
..           ...              ...
515          594                4
516          595                1
517          596                6
518          597                2
519          599                1

[520 rows x 2 columns]